app/Controllers/NoteController.php

    public function index()
    {
        $data = $this->noteModel->findAll();
---
SELECT *
FROM `notes`

    public function delete(int $id) {
        if ($this->noteModel->delete($id)) {
---
DELETE FROM `notes`
WHERE `id` IN (4)

    public function edit(int $id) {
        $data = $this->noteModel->find($id);
---
SELECT *
FROM `notes`
WHERE `notes`.`id` = 6

    public function store() {
        $data = $this->request->getPost();

        $rules = [
            'title' => 'required|string',
            'content' => 'required|max_length[255]|string',
        ];

        if($this->validateData($data, $rules)) {
            $data = $this->validator->getValidated();
            $this->noteModel->insert($data);
---
INSERT INTO `notes` (`title`, `content`, `created_at`, `updated_at`) VALUES ('yftufètfrdyr', 'èrf-rtdy(trsd', '2024-08-19 09:26:22', '2024-08-19 09:26:22')

    public function update(int $id) {
        $data = $this->request->getPost();
        if ($this->noteModel->update($id, $data)) {
---
UPDATE `notes` SET `title` = 'Voici le titre', `content` = 'gheijrhgej', `updated_at` = '2024-08-19 09:04:40'
WHERE `notes`.`id` IN (4)